In [1]:
import pandas as pd
import numpy as np

In [2]:
dfArray = []

In [3]:
for i in range (1980, 2016):
    temp = pd.read_csv(f"csvData/{i}.csv")
    dfArray.append(temp)

In [4]:
len(dfArray)

36

In [5]:
for i in range(len(dfArray)):
    dfArray[i]['Genre'] = dfArray[i]['Genre'].str.split(', ')

In [8]:
imdbID = []
genre = []

In [17]:
dfArray[0]['Genre'][2]
len(dfArray[0]['Genre'][2])

1

In [18]:
for i in range(len(dfArray)): #looping all csv files
    for j in range(len(dfArray[i])): #looping rows in each csv file
        #now for every row we want to check the length of genre array
        #if it's only 1 we append and continue
        #if it's more we loop and append all genres next to the same imdbid
        try:
            for k in range(len(dfArray[i]['Genre'][j])):
                imdbID.append(dfArray[i]['imdbID'][j])
                genre.append(dfArray[i]['Genre'][j][k])
        except:
                imdbID.append(dfArray[i]['imdbID'][j])
                genre.append(dfArray[i]['Genre'][j])

In [19]:
idDF = pd.DataFrame(imdbID)
idDF

               0
0      tt0080684
1      tt0080684
2      tt0080684
3      tt0081562
4      tt0081562
...          ...
30906  tt2241750
30907  tt4797082
30908  tt5350540
30909  tt5350540
30910  tt4529904

[30911 rows x 1 columns]

In [20]:
genreDF = pd.DataFrame(genre)
genreDF

                 0
0           Action
1        Adventure
2          Fantasy
3           Comedy
4            Crime
...            ...
30906        Sport
30907  Documentary
30908  Documentary
30909        Short
30910       Comedy

[30911 rows x 1 columns]

In [21]:
newdata = pd.DataFrame()

In [23]:
newdata['imdbID'] = idDF
newdata['Genre'] = genreDF
newdata

          imdbID        Genre
0      tt0080684       Action
1      tt0080684    Adventure
2      tt0080684      Fantasy
3      tt0081562       Comedy
4      tt0081562        Crime
...          ...          ...
30906  tt2241750        Sport
30907  tt4797082  Documentary
30908  tt5350540  Documentary
30909  tt5350540        Short
30910  tt4529904       Comedy

[30911 rows x 2 columns]

In [25]:
def listToString(s): 
    
    # initialize an empty string
    str1 = "" 
    
    # traverse in the string  
    for ele in s: 
        str1 += ele  
    
    # return string  
    return str1

In [27]:
for i in range(len(newdata)):
    try:
        newdata['Genre'][i] = listToString(newdata['Genre'][i])
    except:
        continue

In [28]:
newdata

          imdbID        Genre
0      tt0080684       Action
1      tt0080684    Adventure
2      tt0080684      Fantasy
3      tt0081562       Comedy
4      tt0081562        Crime
...          ...          ...
30906  tt2241750        Sport
30907  tt4797082  Documentary
30908  tt5350540  Documentary
30909  tt5350540        Short
30910  tt4529904       Comedy

[30911 rows x 2 columns]

In [29]:
newdata.to_csv('MultiGenre.csv')